Repository: GuilhermeConstantino/ABC-Fun
Catalog: lib/l10n/abc_fun_*.arb
Languages: de, es, fr, pt

# menuAccountSync
source: Sync Account
de: Konto synchronisieren
es: Sincronizar cuenta
fr: Synchroniser le compte
pt: Sicronizar conta

# menuSettings
source: Settings
de: Einstellungen
es: Configuraciones
fr: Paramètres
pt: Configurações

# menuChallenges
source: Challenges
de: Herausforderungen
es: Desafíos
fr: Défis
pt: Desafios

# menuDashboard
source: Home
de: Startseite
es: Inicio
fr: Tableau de bord
pt: Inicial

# reportWidgetByTheme
source: Performance by Theme
de: Leistung nach Thema
es: Rendimiento por tema
fr: Performance par thème
pt: Desempenho por tema

# reportWidgetByThemeErrors
source: errors
de: Fehler
es: de errores
fr: erreurs
pt: de erros

# resultWidget
source: Overall Results
de: Gesamtergebnisse
es: Resultados generales
fr: Résultats généraux
pt: Resultados gerais

# resultCardSucessChallenges
source: Successful Challenges
de: Erfolgreiche Herausforderungen
es: Desafíos superados
fr: Défis réussis
pt: Desafios vencidos

# resultCardAverange
source: Average
de: Durchschnitt
es: Promedio
fr: Moyenne
pt: Média

# resultCardDoneChallanges
source: Completed Challenges
de: Abgeschlossene Herausforderungen
es: Desafíos completados
fr: Défis réalisés
pt: Desafios realizados

# menuAbout
source: About
de: Über
es: Acerca de
fr: À propos
pt: Sobre

# menuExit
source: Exit
de: Beenden
es: Salir
fr: Quitter
pt: Sair

# menuScore
source: Score
de: Punktzahl
es: Puntuación
pt: Pontuação

# playCardDescription
source: Hello, ready for many challenges today?
de: Hallo, bereit für viele Herausforderungen heute?
es: ¡Hola! ¿Listo para enfrentar muchos desafíos hoy?
fr: Bonjour, prêt pour de nombreux défis aujourd'hui ?
pt: Olá, pronto para muitos desafios hoje?

# playCardButton
source: Play
de: Spielen
es: Jugar
fr: Jouer
pt: Jogar

# actionAnsweringPhone
source: Answering the Phone
de: Telefon beantworten
es: Atender el teléfono
fr: Répondre au téléphone
pt: Atendendo o telefone

# actionBathing
source: Taking a Bath
de: Baden
es: Bañarse
fr: Prendre un bain
pt: Tomando Banho

# actionBlowingBubbles
source: Blowing Bubbles
de: Seifenblasen pusten
es: Soplar burbujas
fr: Faire des bulles
pt: Assomprando bolhas

# actionBrushingHair
source: Brushing Hair
de: Haare kämmen
es: Cepillarse el cabello
fr: Se brosser les cheveux
pt: Escovando o cabelo

# actionBrushingTeeth
source: Brushing Teeth
de: Zähne putzen
es: Cepillarse los dientes
fr: Se brosser les dents
pt: Escovando os dentes

# actionButtoningShirt
source: Buttoning Shirt
de: Hemd zuknöpfen
es: Abotonar la camisa
fr: Boutonner la chemise
pt: Abotoando a camisa

# actionCatPlayingWithWoolBall
source: Cat Playing with Wool Ball
de: Katze spielt mit Wollball
es: Jugar con una bola de lana
fr: Chat jouant avec une balle de laine
pt: Gato brincando com bola de lã

# actionCatchingBall
source: Catching the Ball
de: Ball fangen
es: Atrapar la pelota
fr: Attraper la balle
pt: Pegando a bola

# actionChasingButterflies
source: Chasing Butterflies
de: Schmetterlingen hinterherjagen
es: Perseguir mariposas
fr: Chasser les papillons
pt: Correndo atrás de borboletas

# actionClappingHands
source: Clapping Hands
de: Hände klatschen
es: Aplaudir
fr: Applaudir
pt: Batendo palmas

# actionClearingTable
source: Clearing the Table
de: Tisch abräumen
es: Limpiar la mesa
fr: Débarrasser la table
pt: Limpando a mesa

# actionClimbingStairs
source: Climbing Stairs
de: Treppen steigen
es: Subir escaleras
fr: Monter les escaliers
pt: Subindo escadas

# actionClimbingTree
source: Climbing a Tree
de: Auf einen Baum klettern
es: Trepar un árbol
fr: Grimper dans un arbre
pt: Subindo em árvore

# actionCooking
source: Cooking
de: Kochen
es: Cocinar
fr: Cuisiner
pt: Cozinhando

# actionCrying
source: Crying
de: Weinen
es: Llorar
fr: Pleurer
pt: Chorando

# actionDancing
source: Dancing
de: Tanzen
es: Bailar
fr: Danser
pt: Dançando

# actionDog
source: Dog
de: Hund
es: Perro
fr: Chien
pt: Cachorro

# actionDrawing
source: Drawing
de: Zeichnend
es: Dibujar
fr: Dessiner
pt: Desenhando

# actionDrinkingWater
source: Drinking Water
de: Wasser trinken
es: Tomar agua
fr: Boire de l'eau
pt: Bebendo água

# actionEating
source: Eating
de: Essen
es: Comer
fr: Manger
pt: Comendo

# actionJumpingRope
source: Jumping Rope
de: Seilspringen
es: Saltar la cuerda
fr: Sauter à la corde
pt: Pulando corda

# actionPlayingBlocks
source: Playing with Blocks
de: Mit Bausteinen spielen
es: Jugar con bloques
fr: Jouer avec des blocs
pt: Brincando com blocos

# actionPlayingWithDog
source: Playing with Dog
de: Mit Hund spielen
es: Jugar con el perro
fr: Jouer avec un chien
pt: Brincando com cachorro

# actionReadingBook
source: Reading a Book
de: Buch lesen
es: Leer un libro
fr: Lire un livre
pt: Lendo livro

# actionReceivingGift
source: Receiving a Gift
de: Geschenk erhalten
es: Recibir un regalo
fr: Recevoir un cadeau
pt: Recebendo presente

# actionRidingBike
source: Riding a Bike
de: Fahrrad fahren
es: Montar en bicicleta
fr: Faire du vélo
pt: Andando de bicicleta

# actionRunning
source: Running
de: Laufen
es: Correr
fr: Courir
pt: Correndo

# actionSinging
source: Singing
de: Singen
es: Cantar
fr: Chanter
pt: Cantando

# actionSleeping
source: Sleeping
de: Schlafen
es: Dormir
fr: Dormir
pt: Dormindo

# actionSwinging
source: Swinging
de: Schaukeln
es: Columpiarse
fr: Se balancer
pt: Balançando

# actionUsingComputer
source: Using a Computer
de: Computer benutzen
es: Usar la computadora
fr: Utiliser un ordinateur
pt: Usando computador

# actionWashingDishes
source: Washing Dishes
de: Geschirr spülen
es: Lavar los platos
fr: Laver la vaisselle
pt: Lavando louça

# actionWashingHands
source: Washing Hands
de: Hände waschen
es: Lavarse las manos
fr: Se laver les mains
pt: Lavando as mãos

# actionWatchingTV
source: Watching TV
de: Fernsehen
es: Ver la televisión
fr: Regarder la télévision
pt: Assistindo TV

# actionWateringPlants
source: Watering Plants
de: Pflanzen gießen
es: Regar las plantas
fr: Arroser les plantes
pt: Regando plantas

# buttonBack
source: Back
de: Zurück
es: Volver
fr: Retour
pt: Voltar

# challengeTitle
source: Challenge Editor
de: Herausforderungseditor
es: Editor de Desafíos
fr: Éditeur de défis
pt: Editor de Desafios

# challengeDescription
source: Here you will find all the themes and images that are used to generate the challenges. You can create new themes according to the needs and context of your child.
de: Hier finden Sie alle Themen und Bilder, die zur Generierung der Herausforderungen verwendet werden. Sie können neue Themen entsprechend den Bedürfnissen und dem Kontext Ihres Kindes erstellen.
es: Aquí encontrarás todos los temas e imágenes que se utilizan para generar los desafíos. Puedes crear nuevos temas según las necesidades y el contexto de tu hijo/a
fr: Vous trouverez ici tous les thèmes et images utilisés pour générer les défis. Vous pouvez créer de nouveaux thèmes en fonction des besoins et du contexte de votre enfant
pt: Aqui você encontra todos os temas e imagens que são utilizadas para gerar os desafios, você pode criar novos temas de acordo com a necessidade e contexto de sua criança

# challengeButtonCreateChallenge
source: Create Challenge
de: Herausforderung erstellen
es: Crear Desafío
fr: Créer un défi
pt: Criar Desafio

# buttonEdit
source: Edit
de: Bearbeiten
es: Editar
fr: Modifier
pt: Editar

# buttonDelete
source: Delete
de: Löschen
es: Eliminar
fr: Supprimer
pt: Excluir

# challengeItemCardImagesQuantity
source: {count, plural, =1{1 image} other {{count} images}}
de: {count, plural, =1{1 Bild} other {{count} Bilder}}
es: {count, plural, =1{1 imagen} other {{count} imágenes}}
pt: {count, plural, =1{1 imagem} other {{count} imagens}}

source: Loading...
de: Laden...
es: Cargando...
fr: Chargement...
pt: Carregando...

# gameError
source: Error, all challenges are disabled
de: Fehler, alle Herausforderungen sind deaktiviert
es: Error, todos los desafíos están desactivados
fr: Erreur, tous les défis sont désactivés
pt: Erro, todos os desafios estão desativados

# gameErrorMin2
source: Error, at least 2 active challenges are required for the game to function correctly
de: Fehler, es sind mindestens 2 aktive Herausforderungen erforderlich, damit das Spiel ordnungsgemäß funktioniert
es: Error, se requieren al menos 2 desafíos activos para el correcto funcionamiento del juego
fr: Erreur, au moins 2 défis actifs sont nécessaires pour le bon fonctionnement du jeu
pt: Erro, é necessário no mínimo 2 desafios ativos para o correto funcionamento do jogo

# createNewChallengePageTitle
source: Create Challenge
de: Herausforderung erstellen
es: Crear desafío
fr: Créer un défi
pt: Criar desafio

# createNewChallengePageDescription
source: Create an action, select images that demonstrate this action
de: Erstellen Sie eine Aktion und wählen Sie Bilder aus, die diese Aktion darstellen
es: Crea una acción y selecciona imágenes que representen esa acción
fr: Créez une action, sélectionnez des images qui représentent cette action
pt: Crie uma ação, selecione imagens que demonstram esta ação

# createNewChallengePageActionName
source: Action Name
de: Aktionsname
es: Nombre de la Acción
fr: Nom de l'action
pt: Nome da Ação

# createNewChallengePageActionNameHint
source: e.g. Sleeping, Eating
de: z.B. Schlafen, Essen
es: ej: Dormir, Comer
fr: ex: Dormir, Manger
pt: ex: Dormindo, comendo

# createNewChallengePageActionAudio
source: Record Audio
de: Audio aufnehmen
es: Grabar audio
fr: Enregistrer un audio
pt: Grave um áudio

# createNewChallengePageActionAudioHint
source: Record audio that clearly exemplifies the created action. The audio enables non-literate children to use the app independently and aids in cognitive reinforcement.
de: Nehmen Sie ein Audio auf, das die erstellte Aktion klar veranschaulicht. Das Audio ermöglicht es nicht alphabetisierten Kindern, die App eigenständig zu nutzen, und fördert die kognitive Verstärkung.
es: Graba un audio que ejemplifique claramente la acción creada. El audio permite que los niños no alfabetizados lo utilicen de forma independiente y ayuda en el refuerzo cognitivo.
fr: Enregistrez un audio qui illustre clairement l'action créée. L'audio permet aux enfants qui ne savent pas encore lire d'utiliser le jeu de manière autonome et contribue au renforcement cognitif.
pt: Grave um áudio que exemplifique claramente a ação criada, o audio dá autonomia para crianças não alfabetizadas utilizarem sozinhas e ajuda no reforço cognitivo.

# createNewChallengePageActionImage
source: Action Images
de: Aktion Bilder
es: Imágenes de la acción
fr: Images de l'action
pt: Imagens da ação

# createNewChallengePageActionImageHint
source: Upload images that clearly exemplify the created action. This is extremely important for the functioning of the challenge (limit 4 images).
de: Laden Sie Bilder hoch, die die erstellte Aktion deutlich veranschaulichen. Dies ist äußerst wichtig für das Funktionieren der Herausforderung (maximal 4 Bilder).
es: Carga imágenes que representen claramente la acción creada. Esto es extremadamente importante para el funcionamiento del desafío (límite de 4 imágenes)
fr: Téléchargez des images qui illustrent clairement l'action créée. Cela est extrêmement important pour le fonctionnement du défi (limite de 4 images)
pt: Carregue imagens que exemplifique claramente a ação criada, isso é extremamente importante para o funcionamento do desafio (limite 4 imagens)

# buttonLoadImages
source: Load Images
de: Bilder laden
es: Cargar imágenes
fr: Charger des images
pt: Carregar imagens

# buttonComplete
source: Complete
de: Abschließen
es: Completar
fr: Terminer
pt: Concluir

# syncAccountPageTitle
source: Sync Accounts
de: Konten synchronisieren
es: Sincronizar Cuentas
fr: Synchroniser les comptes
pt: Sincronizar contas

# settingsPageTitle
source: Phase Settings
de: Bühneneinstellungen
es: Configuraciones de fase
fr: Paramètres de phase
pt: Configurações de fase

# settingsPageDescription
source: Configure the number of phases per round and difficulty (number of images).
de: Konfigurieren Sie die Anzahl der Stufen pro Runde und den Schwierigkeitsgrad (Anzahl der Bilder).
es: Configura el número de fases por ronda y la dificultad (número de imágenes)
fr: Configurez le nombre de phases par round et la difficulté (nombre d'images)
pt: Configure o numero de fases por round e dificuldade (número de imagens)

# settingsPagePhasesTitle
source: Number of Phases
pt: Número de fases

# settingsPagePhases
source: {n, plural, =1{1 phase} other {{n} phases}}
pt: {n, plural, =1{1 fase} other {{n} fases}}

# settingsPageImagesQuantityTitle
source: Number of Images
de: Anzahl der Bilder
es: Cantidad de Imágenes
fr: Quantité d'images
pt: Quantidade de imagens

# settingsPageImagesQuantity
source: {n, plural, =1{1 image} other {{n} images}}
de: {n, plural, =1{1 Bild} other {{n} Bilder}}
es: {n, plural, =1{1 imagen} other {{n} imágenes}}
pt: {n, plural, =1{1 imagem} other {{n} imagens}}

# settingsPageRewardTitle
source: Reward
de: Belohnung
es: Recompensa
fr: Récompense
pt: Recompensa

# settingsPageRewardDescription
source: Set a specific image for when the answer is correct
de: Legen Sie ein bestimmtes Bild fest, wenn die Antwort richtig ist
es: Configura una imagen específica para cuando haya una respuesta correcta
fr: Configurez une image spécifique pour une réponse correcte
pt: Configure uma imagem especifica para quando houver acerto

# aboutPageTitle
source: About
de: Über
es: Acerca de
fr: À propos
pt: Sobre

# aboutPageDescription
source: ABC Fun is an innovative game based on the Applied Behavior Analysis (ABA) method. It was developed with the aim of assisting autistic children in the learning process. Created with dedication by Jhionan Rian Lara dos Santos and Bruno Stefanis Leal, and guided by Dr. Alexander Robert Kutzke as part of their conclusion in the Analysis and Development of Systems course at the Federal University of Paraná (UFPR). ABC Fun offers an interactive and engaging experience. The ABC Fun game combines the principles of the ABA method with playful and interactive elements, specifically adapted to meet the needs of autistic children. Through a series of carefully designed activities. The design of this game was created by student Guilherme Antônio Constantino, guided by Professor Dr. Ricardo Z. N. Vêncio, for the Biomedical Informatics course at the Ribeirão Preto Medical School of the University of São Paulo, in 2021.
de: ABC Fun ist ein innovatives Spiel, das auf der Methode der Angewandten Verhaltensanalyse (ABA) basiert. Es wurde mit dem Ziel entwickelt, autistischen Kindern beim Lernprozess zu helfen. Es wurde mit Hingabe von Jhionan Rian Lara dos Santos und Bruno Stefanis Leal entwickelt und unter der Anleitung von Dr. Alexander Robert Kutzke im Rahmen ihres Abschlusses im Studiengang Analyse und Entwicklung von Systemen an der Bundesuniversität von Paraná (UFPR) erstellt. ABC Fun bietet ein interaktives und ansprechendes Erlebnis. Das Spiel ABC Fun kombiniert die Prinzipien der ABA-Methode mit spielerischen und interaktiven Elementen, die speziell auf die Bedürfnisse autistischer Kinder zugeschnitten sind. Durch eine Reihe sorgfältig gestalteter Aktivitäten. Das Spiel wurde von Guilherme Antônio Constantino entwickelt, der von Professor Dr. Ricardo Z. N. Vêncio betreut wurde, für den Studiengang Biomedizinische Informatik an der Fakultät für Medizin in Ribeirão Preto der Universität São Paulo im Jahr 2021.
es: ABC Fun es un juego innovador basado en el método ABA (Análisis Aplicado del Comportamiento). Fue desarrollado con el objetivo de ayudar a niños autistas en su proceso de aprendizaje. Creado con dedicación por Jhionan Rian Lara dos Santos y Bruno Stefanis Leal, y bajo la supervisión del Dr. Alexander Robert Kutzke como parte de su proyecto final en el curso de Análisis y Desarrollo de Sistemas de la Universidad Federal de Paraná (UFPR). ABC Fun ofrece una experiencia interactiva y atractiva. El juego combina los principios del método ABA con elementos lúdicos e interactivos adaptados específicamente para satisfacer las necesidades de los niños autistas. A través de una serie de actividades cuidadosamente diseñadas. La concepción de este juego fue realizada por el estudiante Guilherme Antônio Constantino, bajo la supervisión del Dr. Ricardo Z. N. Vêncio, como parte del curso de Informática Biomédica de la Facultad de Medicina de Ribeirão Preto de la Universidad de São Paulo, en el año 2021.
fr: ABC Fun est un jeu innovant basé sur la méthode ABA (Analyse Appliquée du Comportement). Il a été développé dans le but d'aider les enfants autistes dans leur processus d'apprentissage. Créé avec dévouement par Jhionan Rian Lara dos Santos et Bruno Stefanis Leal, sous la supervision du Dr Alexander Robert Kutzke, dans le cadre de leur diplôme en Analyse et Développement de Systèmes à l'Université Fédérale du Paraná (UFPR). ABC Fun offre une expérience interactive et captivante. Le jeu ABC Fun combine les principes de la méthode ABA avec des éléments ludiques et interactifs, spécialement adaptés pour répondre aux besoins des enfants autistes. À travers une série d'activités soigneusement conçues. La conception de ce jeu a été réalisée par l'étudiant Guilherme Antônio Constantino, sous la supervision du Dr Ricardo Z. N. Vêncio, dans le cadre du cours de Biomédecine Informatique de la Faculté de Médecine de Ribeirão Preto de l'Université de São Paulo, en 2021
pt: ABC Fun é um jogo inovador baseado no método ABA (Análise do Comportamento Aplicada) foi desenvolvido com o objetivo de auxiliar crianças autistas no processo de aprendizado. Criado com dedicação por Jhionan Rian Lara dos Santos e Bruno Stefanis Leal, e orientados pelo Dr Alexander Robert Kutzke como parte de sua conclusão no curso de Análise e Desenvolvimento de Sistemas da Universidade Federal do Paraná (UFPR). O ABC Fun oferece uma experiência interativa e envolvente. O jogo ABC Fun combina os princípios do método ABA com elementos lúdicos e interativos, adaptados especificamente para atender às necessidades das crianças autistas. Através de uma série de atividades cuidadosamente projetadas. A concepção desse jogo foi feita pelo aluno Guilherme Antônio Constantino, orientado pelo Professor Doutor Ricardo Z. N. Vêncio, para o curso de Informática Biomédica da Faculdade de Medicina de Ribeirão Preto da Universidade de São Paulo, no ano de 2021

# menuTitle
source: Menu
de: Menü
es: Menú
